import java.util.Scanner;

public class threeproject {

    Scanner src = new Scanner(System.in);
    public static void main(String[] args) {
    String str ="Мы проводим комплексную терапию дакриоаденита, которая включает лечение основного заболевания и симптомов воспаления слезной железы. Пациентам назначаются антибактериальные препараты (антибиотики, сульфаниламиды), противовоспалительные, антимикробные средства в виде глазных капель, мазей, для приема внутрь; УВЧ-терапия, электролечение. При необходимости мы проводим вскрытие очага гнойного воспаления слезной железы.";
    String x = System.in.read();
    int y= str.indexOf(x);


    }
}



